[{"PostURL": "https://abcnews.go.com/Health/live-updates/coronavirus/?id=81441585", "TruthRating": "mostly true", "Comments": ["Travel bans I thought they were zenophobic and racist? They weren’t when Trump imposed one and they aren’t now, but raving liberals won’t admit they are hypocrites. Hell if we could get one at the border we might get a hold on this, but walls don’t work except at Biden’s beach house, the White House and the home of other politicians.", "I just don't think they do much. They haven't seemed to so far.", "Well, they’re not being followed so there’s that.", "All they do is delay the inevitible.", "Travel bans buy a bit of time.Not acting increases transmission/ mutations. Fortunately science gave the world a safe and effective set of vaccines.Unfortunately, 60% of GOQP unvaccinated, while 17% of Independents and 17% of Blue is unvaccinated. KFF dot org.It speaks volumes of the political messaging being sent to ‘the base’ over data and common sense.  World 🌎 has not seen the last variant.", "Yes keep thinking it's the evil Republicans, and not the 18-30 year olds that are not anti vax, they're just lazy and haven't don't it yet. Did they ask you who you voted for when you got the shot? Nobody asked me who I voted for. Where do you come up with this ridiculous data that you pretend is true.", "The poll speaks for itself about “evil Republicans”- your term -“A new KFF COVID-19 Vaccine Monitor ““Now, six months later, in October 2021, one-quarter (27%) of U.S. adults say they have not gotten a COVID-19 vaccine, but the unvaccinated population is now disproportionately made up of those who identify as Republican or Republican-leaning, with six in ten (60%) identifying as Republican or Republican-leaning (compared to about four in ten of the U.S. total adult population1) and just one in six (17%) calling themselves Democrats or Democratic-leaning. See Appendix figure 1 for a full demographic profile of unvaccinated adults from April to October 2021.“", "So we are believing polls now? I thought we gave up after 2016. Again, nobody has ever asked me or anyone in my family, so I have very little faith in your \"data\". I have however heard from all 3 of my college age daughters how lots of their friends' have either not done it, or got 1 shot and not gone back for the second. I know you want to blame this on politics, but the fact is you're wrong. Sure there may be Republicans that have not or will not do it. Thinking this is the biggest group not getting the shot is a mistake and just shows how ignorant you are. Remember when the vaccine was coming out and Biden, Harris, Cuomo, Pelosi, Newsom, Schumer....et al said they would not trust the vaccine? Now they wonder why that generation is not lining up for a shot. Hilarious.", "Keep pretending that vaccinations strongly protect you against infection.", "Literally nobody thinks that.", "Data says vaccine is 5.8 times better than ‘natural’.  Why?  Because vaccine provides a signature of the virus, and the body immune system prepares the defense.  If not exposed, the unvaccinated immune system is not ready to fight off the virus, and the virus will live longer, increasing the likelihood of transmission.If ‘you already had it’, you likely had just mild exposure, and here the body fights it off in a shorter time—and hence has less time to build up the defense mechanism.   This is common sense.", "Your source trust me bro....", "Read some Lancet or Nature articles... bro...", "Keep believing they're an infringement on your freedom. Know that 3 of my unvaccinated family members have succumbed.", "LOL This variant is already widespread in the USA.We don't do much in the way of random testing.", "Maybe, but the mutations may make it less virulent than previous versions of COVID, which is the way viruses tend to mutate over the long-tern-increased efficiency in transmission, but lower virulence.", "Got a study backing you up or are you way ahead of the experts in deciphering the potential mutation affects?", "Virus 🦠 replicates ‘exact copies’, but even viruses make mistakes and hence the mutation.  There is no way of knowing if the virus will be more infectious or cause more illness-virus is not that ‘smart’.", "That's a lot of bs in one post. Congrats.", "KFF dot org for the poll data 😉", "Delaying is good for spreading the sick in the hospitals.", "and what is wrong with delaying it?.. that is the whole purpose of a travel ban .. to slow the spread so hospitals are not overwhelmed and new vaccines can be developed before large numbers of people die.  If Trump had shut down all International travel early in 2020... up to 200K lives could have been saved by slowing the spread ahead of vaccine availability. And Trump wouldn't have lost 2020 so badly.", "They gain time for nations to organize and for scientists to investigate.", "Travel bans SLOW the spread, so there is more time to act. One must understand the purpose, before ignorantly proclaiming a failure.", "Unless it’s a complete ban on foreign travel they are meaningless.Obviously, a US citizen can bring it back home just as much as a foreign national.", "Thanks Q Anon", "They have that in Africa?", "Those walls didn't work at the Capital either.", "As usual context matters. Trump was called Xenophobic because he had just spent a year trying to ban Muslims from entering the us. So when he started calling for bans it was with that baggage behind him. Biden does not have that particular baggage.And frankly the best thing a travel ban is going to accomplish is to delay the inevitable. It's what you do with that little extra time that matters. If you waste that time downplaying the virus and telling people it is all under control then the ban is worthless anyway.", "No, he specifically said Muslim countries which supported terrorists.  He didn't ban Saudi Arabia, Egypt, Indonesia or India, the largest Muslim countries in the world.", "He originally wanted to go full ban. In a speech he gave during his campaign he said \"Donald J Trump is calling for a total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.\" He later walked it back to more limited countries but he'd already spoken his mind. And even then his ban included  those with legitimate visas who had already been vetted. Also the fact that in his initial order he had an exemption for religious minorities to be sure that he was specifically targeting muslims certainly doesn't help his case. There is no way to sugarcoat that to make it look like anything other than what it was.", "The initial statement which was quickly clarified was in response to several mass shootings and murders by self-proclaimed Islamic terrorists calling for Jihad against Christians and death to all Americans including the mass shooting at San Bernardino, the attacks on two military bases, the public murder and rape of a woman, and and a violent attack overseas, all in the name of Jihad.  So no,  I don't blame him for reacting that way nor did the majority of scared Americans on both sides of the political isle which is why he won a significant portion of democrat vote.   And if the Muslim community had come out and condemned it as they were asked to do,  which they did not, he probably wouldn't have said it.  They traced the shooter back to a mosque where they were teaching Jihad and death to Americans or did you forget?", "\"And if the Muslim community had come out and condemned it as they were asked to do, which they did not, he probably wouldn't have said it.\"Sorry to change the subject but this line just screams at me regarding Jan 6 and the republicans bending over backwards to pretend nothing happened.", "Huh?   No one died on Jan 6th except an innocent unarmed American Veteran wife who was shot by a Capitol policeman.   There were no fires and three broken windows.  Hardly an uprising.", "Several died, one or two were killed.  The others were \"natural causes.\"  Babbitt was an unarmed white woman murdered by a black capitol cop with an itchy trigger finger, and another unarmed woman was apparently beaten to death by capitol cops.  They originally thought she was a drug overdose.", "yes", "I figured your response would be something like that.", "He didn't say ANYTHING about muslims.  He was using barry's terrorist threat list.", "Bingo!  It was bathhouse Barrys.", "Trump's had nothing to do with Covid, despite his pretense to the contrary.", "That's right - it was to try to deal with terrorist attacks in the US.", "Not that either.  All Trump did was try to tell us there was nothing to worry about.  Over 700,000 Americans died as a result.", "Do you need me to explain to you why travel bans to curb the spread of a pandemic aren't the same as travel bans put in place to stimulate our nation's least-educated zenophobic nationalists?  There's nothing hypocritical about that.  Also, stop getting your information from anti-news sources.  The border isn't wide open and even if it was, that's not the source of COVID.  It doesn't work that way.  I understand you're not very bright and believe all sources of bad things come from people you don't like (Mexicans, Liberals, etc...) but that's not how any of this works.", "Attacking someone's intelligence immediately lessens your credibility.  \"Wide open borders\", a term which many of the left and right now use if you live on border states,  refers to the almost complete lack of enforcement.   We are united in our opposition to this regardless of politics.  It is a travesty.", "Says someone who twice voted for a guy who attacked people's intelligence on a daily basis, while patting himself on the back and claiming to be a genius.  Yeah, I'm gonna go ahead and disregard your first line since you obviously suffer from cognitive dissonance.I live in Texas.  It doesn't get more \"border state\" than that.  I also travel to and from the border a few times per year and guess what!  It's not wide open.  Nothing's changed.  I get stopped every time in the same places by border patrol.You are united in ignorance.", "Lol.. So then how are illegal immigrants getting in the states? I know it might be hard for you to grasp, but they don't get in the country using the designated border crossings.Conservatives want the cheap labor while democrats want the liberal votes so both parties have done virtually nothing.", "Uh...  The same way they have been for years?  What kind of stupid question was that?\"Conservatives want the cheap labor while democrats want the liberal votes so both parties have done virtually nothing.\"Because somehow not finishing high school and deciding instead to make a living doing manual labor should net you the same income as an engineer with a graduate degree.  And democrats want the liberal votes?  Stupid comment...", "I didn't vote for Trump.  I am a Libertarian.", "Do you honestly think anyone believes you didn't vote for the guy you seem to keep valiantly defending in your comments, along with your bogus January 6th claims?  Who do you think you're fooling?  I'll also add that most of our \"independents\" are actually  Trump supporters and one could argue that they're even more far-right than our registered Republicans.", "Who is \"anyone\"?   Losers who live on an ABC news?"]}]